export const en = {
  translation: {
    "slashMenu": {
      "title": "Додати наявні пакети робіт",
      "subtext": "Додати динамічне посилання на окремий робочий пакет",
      "aliases": {
        "workpackage": "робочий пакет",
        "work package": "пакет робіт",
        "wp": "пр",
        "link": "посилання"
      }
    },
    'search': {
      'label': 'Додати наявні пакети робіт',
      'placeholder': 'Пошук за ID робочого пакета або темою',
      'dropdownAriaLabel': 'Результати пошуку робочого пакета'
    },
    'unavailableWorkPackage': {
      'loading': {
        'header': 'Завантаження…',
        'message': 'Будь ласка, зачекайте'
      },
      'unauthorized': {
        'header': "Пов'язаний робочий пакет недоступний",
        'message': 'У вас немає прав щоб побачити це.'
      },
      'error': {
        'header': 'Помилка',
        'message': 'Не вдалося завантажити робочий пакет'
      }
    },
    "options": {
      "openInNewTab": "Відкрити у новій вкладці",
      "open": "Відкрити",
      "changeSize": "Змінити розмір",
      "remove": "Видалити",
      "removeAriaLabel": "Видалити робочий пакет",
      "openAriaLabel": "Відкрити робочий пакет {{id}} у новій вкладці",
      "inlineSizeLabel": "Вбудований розмір",
      "blockSizeLabel": "Розмір блоку",
      "chipAriaLabel": "Робочий пакет {{id}}"
    },
    "sizes": {
      "xxs": {
        "label": "Крихітний",
        "desc": "Ідентифікатор"
      },
      "xs": {
        "label": "Компактний",
        "desc": "Тип, Ідентифікатор, Тема"
      },
      "s": {
        "label": "Звичайний",
        "desc": "Статус, Тип, Ідентифікатор, Тема"
      },
      "m": {
        "label": "Компактна картка",
        "desc": "Статус, Тип, Ідентифікатор, Тема"
      },
      "l": {
        "label": "Звичайна картка",
        "desc": "Ідентифікатор, Тема, Тип, Статус, Батьківський, Проєкт"
      },
      "xl": {
        "label": "Повна картка",
        "desc": "Ідентифікатор, Тема, Тип, Статус, Батьківський, Проєкт, Опис"
      }
    },
    "hashMenu": {
      "typeToSearch": "Введіть для пошуку робочих пакетів…",
      "noResults": "Немає результатів для \"{{query}}\""
    }
  }
};
