<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>9.&nbsp;&#35373;&#23450;</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.70.1"><link rel="start" href="index.html" title="&#12518;&#12540;&#12470;&#12510;&#12491;&#12517;&#12450;&#12523;"><link rel="up" href="ch02.html" title="Chapter&nbsp;2.&nbsp;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;"><link rel="prev" href="ch02s08.html" title="8.&nbsp;&#12501;&#12449;&#12452;&#12523;"><link rel="next" href="ch03.html" title="Chapter&nbsp;3.&nbsp;&#12518;&#12540;&#12470;&#12450;&#12459;&#12454;&#12531;&#12488;"></head><body><a href="http://redmine.rubyforge.org/"><img src="../redmine.png" alt="redmine"></a><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">9.&nbsp;&#35373;&#23450;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch02s08.html">Prev</a>&nbsp;</td><th width="60%" align="center">Chapter&nbsp;2.&nbsp;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch03.html">Next</a></td></tr></table><hr></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e545"></a>9.&nbsp;&#35373;&#23450;</h2></div></div></div><p></p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e549"></a>9.1.&nbsp;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#27231;&#33021;</h3></div></div></div><p></p><div class="itemizedlist"><ul type="disc"><li><p><span class="guilabel">&#20844;&#38283;</span> : &#20844;&#38283;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#20197;&#22806;&#12418;&#21547;&#12417;&#12383; &#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12364;&#38322;&#35239;&#65288;&#35201;&#27714;&#12289;&#25991;&#26360;&#12394;&#12393;&#12434;&#65289;&#12391;&#12365;&#12414;&#12377;&#12290; &#20844;&#38283;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12394;&#12356;&#22580;&#21512;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#12415;&#12364; &#12525;&#12540;&#12523;&#12395;&#24467;&#12387;&#12390;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290;</p></li><li><p><span class="guilabel">&#12459;&#12473;&#12479;&#12512;&#12501;&#12451;&#12540;&#12523;&#12489;</span> : &#20351;&#29992;&#12375;&#12383;&#12356;&#12459;&#12473;&#12479;&#12512;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; &#31649;&#29702;&#32773;&#12384;&#12369;&#12364;&#26032;&#12375;&#12356;&#12459;&#12473;&#12479;&#12512;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#23450;&#32681;&#12391;&#12365;&#12414;&#12377;&#12290;</p></li></ul></div><p></p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e565"></a>9.2.&nbsp;&#12513;&#12531;&#12496;&#12540;</h3></div></div></div><p>&#12513;&#12531;&#12496;&#12540;&#30011;&#38754;&#12391;&#12399;&#12513;&#12531;&#12496;&#12540;&#12398;&#12525;&#12540;&#12523;&#12384;&#12369;&#12391;&#12394;&#12367;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398; &#12513;&#12531;&#12496;&#12540;&#12418;&#23450;&#32681;&#12391;&#12365;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12399;&#19968;&#12388;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#19968;&#12388;&#12398;&#12525;&#12540;&#12523;&#12384;&#12369; &#25345;&#12388;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12513;&#12531;&#12496;&#12540;&#12398;&#12525;&#12540;&#12523;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#20869;&#12391;&#12398;&#27177;&#38480;&#12434; &#27770;&#23450;&#12375;&#12414;&#12377;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e570"></a>9.3.&nbsp;&#12496;&#12540;&#12472;&#12519;&#12531;</h3></div></div></div><p>Versions allow you to follow the changes made during all the project. For instance, at the close of an Issue, you can indicate which version takes it into account. You can display the various versions of the application (see Files).</p><p>&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#38291;&#12395;&#12394;&#12373;&#12428;&#12383;&#22793;&#26356;&#12434;&#36861;&#12358;&#12371;&#12392;&#12364; &#12391;&#12365;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#21839;&#38988;&#12398;&#12463;&#12525;&#12540;&#12474;&#12395;&#12362;&#12356;&#12390;&#12289;&#12393;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391; &#22793;&#26356;&#12364;&#34892;&#12431;&#12428;&#12383;&#12363;&#12434;&#31034;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12373;&#12414;&#12374;&#12414;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#34920;&#31034;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377; &#65288;&#12501;&#12449;&#12452;&#12523;&#30011;&#38754;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e577"></a>9.4.&nbsp;&#21839;&#38988;&#12398;&#12459;&#12486;&#12468;&#12522;</h3></div></div></div><p>&#21839;&#38988;&#12398;&#12459;&#12486;&#12468;&#12522;&#12399;&#21839;&#38988;&#12434;&#25972;&#29702;&#12391;&#12365;&#12414;&#12377;&#12290;&#12459;&#12486;&#12468;&#12522;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398; &#12373;&#12414;&#12374;&#12414;&#12394;&#27083;&#25104;&#35201;&#32032;&#12395;&#35442;&#24403;&#12375;&#12414;&#12377;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch02s08.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch02.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch03.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">8.&nbsp;&#12501;&#12449;&#12452;&#12523;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;3.&nbsp;&#12518;&#12540;&#12470;&#12450;&#12459;&#12454;&#12531;&#12488;</td></tr></table></div></body></html>