<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>11.&nbsp;Configuration</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.70.1"><link rel="start" href="index.html" title="Documentation"><link rel="up" href="ch01.html" title="Chapter&nbsp;1.&nbsp;Administration"><link rel="prev" href="ch01s10.html" title="10.&nbsp;Authentification"><link rel="next" href="ch01s12.html" title="12.&nbsp;Informations"></head><body><a href="http://redmine.rubyforge.org/"><img src="../redmine.png" alt="redmine"></a><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">11.&nbsp;Configuration</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch01s10.html">Prev</a>&nbsp;</td><th width="60%" align="center">Chapter&nbsp;1.&nbsp;Administration</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch01s12.html">Next</a></td></tr></table><hr></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e471"></a>11.&nbsp;Configuration</h2></div></div></div><p>Cet &eacute;cran vous permet de modifier les param&egrave;tres de configuration de l'application. Tous ces param&egrave;tres sont conserv&eacute;s dans la base de donn&eacute;es de l'application. Ils sont donc conserv&eacute;s lorsque vous effectuez une mise &agrave; jour de votre installation.</p><p></p><div class="itemizedlist"><ul type="disc"><li><p><span class="guilabel">Titre de l'application</span></p><p>Titre qui appara&icirc;t en en-t&ecirc;te des pages de l'application.</p></li><li><p><span class="guilabel">Sous-titre de l'application</span></p><p>Sous-titre qui appara&icirc;t en en-t&ecirc;te des pages de l'application.</p></li><li><p><span class="guilabel">Texte d'accueil</span></p><p>Texte affich&eacute; sur la page d'accueil de l'application. Ce texte peut contenir des balises HTML.</p></li><li><p><span class="guilabel">Langue par d&eacute;faut</span></p><p>La langue par d&eacute;faut est s&eacute;lectionn&eacute;e lorsque l'application n'a pas pu d&eacute;terminer la langue d&eacute;finie au niveau du navigateur de l'utilisateur.La langue par d&eacute;faut est &eacute;galement utilis&eacute;e lors de l'envoi de mail &agrave; plusieurs utilisateurs.</p><p><span class="emphasis"><em>D&eacute;faut: Anglais</em></span></p></li><li><p><span class="guilabel">Format de date</span></p><p>Cette option permet de choisir le format d'affichage des dates dans l'application:</p><div class="itemizedlist"><ul type="circle"><li><p>Bas&eacute; sur la langue : les dates seront affich&eacute;es selon le format de date d&eacute;fini pour chaque langue (JJ/MM/AAAA pour le fran&ccedil;ais)</p></li><li><p>ISO 8601: les dates seront toujours affich&eacute;es au format ISO (AAAA-MM-JJ)</p></li></ul></div><p><span class="emphasis"><em>D&eacute;faut: Bas&eacute; sur la langue</em></span></p></li><li><p><span class="guilabel">Authentif. obligatoire</span></p><p>Si cette option est coch&eacute;e, aucune page de l'application n'est accessible sans s'&ecirc;tre identifi&eacute;. Elle permet donc ne rendre accessible l'application qu'aux utilisateurs qui disposent d'un compte valide.</p><p><span class="emphasis"><em>D&eacute;faut: Non</em></span></p></li><li><p><span class="guilabel">Enregistrement autoris&eacute;</span></p><p>Si cette option est coch&eacute;e, la proc&eacute;dure d'enregistrement en ligne est disponible. L'envoi de mails doit &ecirc;tre correctement configur&eacute; pour que les utilisateurs puissent activer leur compte (voir S'enregistrer)</p><p><span class="emphasis"><em>D&eacute;faut: Oui</em></span></p></li><li><p><span class="guilabel">Mot de passe perdu</span></p><p>Si cette option est coch&eacute;e, la proc&eacute;dure de changement de mot de passe est disponible. L'envoi de mails doit &ecirc;tre correctement configur&eacute; pour que les utilisateurs puissent choisir un nouveau mot de passe.</p><p><span class="emphasis"><em>D&eacute;faut: Oui</em></span></p></li><li><p><span class="guilabel">Taille max des fichiers</span></p><p>Taille maximale des fichiers pouvant &ecirc;tre envoy&eacute;s &agrave; l'application (en kilo-octets).</p><p><span class="emphasis"><em>D&eacute;faut: 2048 (soit 2Mo)</em></span></p></li><li><p><span class="guilabel">Limite export demandes</span></p><p>Nombre maximale de demandes contenues dans les exports CSV et PDF.</p><p><span class="emphasis"><em>D&eacute;faut: 500</em></span></p></li><li><p><span class="guilabel">Adresse d'&eacute;mission</span></p><p>Adresse mail utilis&eacute;e comme adresse d'&eacute;mission (champ From des mails) lors de l'envoi de messages aux utilisateurs.</p></li><li><p><span class="guilabel">Nom d'h&ocirc;te</span></p><p>Nom d'h&ocirc;te de l'application. Ce nom est utilis&eacute; pour l'&eacute;criture des URL dans les mails envoy&eacute;s aux utilisateurs.</p></li><li><p><span class="guilabel">Formatage du texte</span></p><p>D&eacute;finit la m&eacute;thode de formatage appliqu&eacute;e aux champs "description" des demandes, annonces, documents...</p><p>L'option "Textile" n'est disponible que si la libraire ruby RedColth est install&eacute;e. Consulter la page d'information pour savoir si vous disposez de cette librairie.</p></li><li><p><span class="guilabel">Compression historique wiki</span></p><p>Permet d'activer la compression de l'historique des pages wiki stock&eacute;es dans la base de donn&eacute;es (diminution de l'espace occup&eacute;).</p><p><span class="emphasis"><em>D&eacute;faut: d&eacute;sactiv&eacute;</em></span></p></li><li><p><span class="guilabel">Limite du contenu des flux RSS</span></p><p>Nombre maximal d'enregistrements contenus dans les flux RSS.</p><p><span class="emphasis"><em>D&eacute;faut: 15</em></span></p></li><li><p><span class="guilabel">R&eacute;cup&eacute;ration auto. des commits</span></p><p>Si cette option est activ&eacute;e, l'application r&eacute;cup&egrave;re automatiquement les nouvelles r&eacute;visions apport&eacute;es sur le d&eacute;p&ocirc;t de sources du projet lorsqu'un utilisateur consulte le d&eacute;p&ocirc;t.</p><p><span class="emphasis"><em>D&eacute;faut: Oui</em></span></p><p>Vous pouvez d&eacute;sactiver cette option et automatiser l'appel &agrave; Repository#fetch_changesets pour r&eacute;cup&eacute;rer r&eacute;guli&egrave;rement les r&eacute;visions de l'ensemble des d&eacute;p&ocirc;ts en arri&egrave;re plan.</p><p>Exemple : <code class="code">ruby script/runner "Repository.fetch_changesets"</code></p></li><li><p><span class="guilabel">Activer les WS de gestion des d&eacute;p&ocirc;ts</span></p><p>Cette option ne doit &ecirc;tre activ&eacute;e que si vous avez install&eacute; le script de cr&eacute;ation automatique des d&eacute;p&ocirc;ts.</p><p><span class="emphasis"><em>D&eacute;faut: Non</em></span></p><p></p></li></ul></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch01s10.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch01.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch01s12.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">10.&nbsp;Authentification&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;12.&nbsp;Informations</td></tr></table></div></body></html>