<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>1.&nbsp;Projets</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.70.1"><link rel="start" href="index.html" title="Documentation"><link rel="up" href="ch01.html" title="Chapter&nbsp;1.&nbsp;Administration"><link rel="prev" href="ch01.html" title="Chapter&nbsp;1.&nbsp;Administration"><link rel="next" href="ch01s02.html" title="2.&nbsp;Utilisateurs"></head><body><a href="http://redmine.rubyforge.org/"><img src="../redmine.png" alt="redmine"></a><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">1.&nbsp;Projets</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch01.html">Prev</a>&nbsp;</td><th width="60%" align="center">Chapter&nbsp;1.&nbsp;Administration</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch01s02.html">Next</a></td></tr></table><hr></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e7"></a>1.&nbsp;Projets</h2></div></div></div><p>Ces &eacute;crans vous permettent de g&eacute;rer les projets.</p><p></p><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e13"></a>1.1.&nbsp;Liste des projets</h3></div></div></div><p>Sur cet &eacute;cran, vous pouvez archiver ou supprimer un projet.</p><p>Un projet archiv&eacute; est conserv&eacute; mais n'est plus visible, y compris par ses membres. Il peut &ecirc;tre restaur&eacute; par l'administrateur.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e20"></a>1.2.&nbsp;Cr&eacute;ation ou modification d'un projet</h3></div></div></div><p></p><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e24"></a>1.2.1.&nbsp;Propri&eacute;t&eacute;s du projet</h4></div></div></div><p></p><div class="itemizedlist"><ul type="disc"><li><p><span class="guilabel">Public</span>: si le projet est public, il sera visible par tous les utilisateurs, y compris ceux qui ne sont pas membres du projet. Si le projet n'est pas public, seuls les membres du projet y ont acc&egrave;s, en fonction de leur r&ocirc;le.</p></li><li><p><span class="guilabel">Sous-projet de</span>: permet de d&eacute;finir le projet parent. La hi&eacute;rarchie des projets est limit&eacute;e &agrave; 2 niveaux. Un projet parent ne peut pas &ecirc;tre lui-m&ecirc;me un sous-projet.</p></li><li><p><span class="guilabel">Nom</span>: nom d'affichage du projet (doit &ecirc;tre unique)</p></li><li><p><span class="guilabel">Description</span>: texte qui appara&icirc;t sur l'&eacute;cran d'aper&ccedil;u du projet</p></li><li><p><span class="guilabel">Identifiant</span>: nom du projet utilis&eacute; de mani&egrave;re interne par l'application (doit &ecirc;tre unique). Une fois le projet cr&eacute;&eacute;, cet identifiant ne peut pas &ecirc;tre modifi&eacute;.</p></li><li><p><span class="guilabel">Champs personnalis&eacute;s</span>: s&eacute;lectionner les champs personnalis&eacute;s que vous souhaitez utiliser pour les demandes du projet. Seul l'administrateur peut d&eacute;finir de nouveaux champs personnalis&eacute;s.</p></li></ul></div><p></p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e60"></a>1.2.2.&nbsp;D&eacute;p&ocirc;t</h4></div></div></div><p>Un d&eacute;p&ocirc;t de sources peut &ecirc;tre associ&eacute; &agrave; chaque projet. Une fois le d&eacute;p&ocirc;t du projet configur&eacute;, vous pourrez le parcourir et consulter les r&eacute;visions. Les r&eacute;visions du d&eacute;p&ocirc;t apparaissent dans la vue <span class="guilabel">Activit&eacute;</span> du projet.</p><p>Pour associer un d&eacute;p&ocirc;t au projet, cocher l'option <span class="guilabel">D&eacute;p&ocirc;t</span> dans la configuration du projet. Choisir le type de d&eacute;p&ocirc;t et saisir ses propri&eacute;t&eacute;s (exemple: <code class="code">svn://hote/mondepot/</code> pour un d&eacute;p&ocirc;t SVN).</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e76"></a>1.2.3.&nbsp;Wiki</h4></div></div></div><p>Chaque projet peut b&eacute;n&eacute;ficier d'un wiki.</p><p>Pour l'activer, cocher l'option <span class="guilabel">Wiki</span> dans la configuration du projet. Un nom de page principale doit &ecirc;tre identiqu&eacute;. Cette page sera la premi&egrave;re page affich&eacute;e lors de la consultation du wiki.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e86"></a>1.2.4.&nbsp;Membres</h4></div></div></div><p>Cett section vous permet de d&eacute;finir les membres du projet ainsi que leurs r&ocirc;les respectifs. Un utilisateur ne peut avoir qu'un r&ocirc;le au sein d'un projet donn&eacute;. Le r&ocirc;le d'un membre d&eacute;termine les permissions dont il b&eacute;n&eacute;ficie sur le projet.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e91"></a>1.2.5.&nbsp;Versions</h4></div></div></div><p>Les versions vous permettent de suivre les changements survenus tout au long du projet. La date figurant sur la version correspond &agrave; sa date d'&eacute;ch&eacute;ance. Les versions pour lesquelles la date n'est pas encore pass&eacute;e sont affich&eacute;es sur la vue "Roadmap".</p><p>Vous pouvez associer une page wiki &agrave; chaque version du projet. Le contenu de chaque page appara&icirc;tra sur la <span class="guilabel">Roadmap</span>.</p><p>Sur chaque demande, vous pouvez indiquer quelle version la prend en compte. La demande appara&icirc;tra alors sur l' <span class="guilabel">Historique</span> (lorsque la demande sera ferm&eacute;e) et la <span class="guilabel">Roadmap</span>.</p><p>Vous pouvez &eacute;galement publier les fichiers associ&eacute;s aux diff&eacute;rentes versions de l'application (voir Fichiers).</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e111"></a>1.2.6.&nbsp;Cat&eacute;gories des demandes</h4></div></div></div><p>Les cat&eacute;gories de demande vous permettent de typer les demandes. Les cat&eacute;gories peuvent par exemple correspondre aux diff&eacute;rents modules du projet.</p><p>Une cat&eacute;gorie r&eacute;f&eacute;renc&eacute;e sur des demandes ne peut pas &ecirc;tre supprim&eacute;e.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h4 class="title"><a name="d0e118"></a>1.2.7.&nbsp;Forums</h4></div></div></div><p>Chaque projet peut contenir un ou plusieurs forums de discussion.</p><p></p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch01.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ch01.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch01s02.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter&nbsp;1.&nbsp;Administration&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;2.&nbsp;Utilisateurs</td></tr></table></div></body></html>